// 0. Демонстрация решения
// Напишите программу, которая на вход
// принимает число и выдаёт его квадрат (число
// умноженное на само себя).
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

Console.Write("Введите Ваше число: ");
int number = Convert.ToInt32(Console.ReadLine());
int result = number*number;
Console.Write("Результат ");
Console.WriteLine(result);

